# Общий объем продаж.
# Покупатель приобретает в магазине пять товаров.
# Напишите программу, которая запрашивает цену каждого товара и затем
# выводит накопленную стоимость приобретаемых товаров, сумму налога с
# продаж и итоговую сумму. Допустим, что налог с продаж составляет 7%.

# Пять преобретаемых товаров.
product1 = 0.0
product2 = 0.0
product3 = 0.0
product4 = 0.0
product5 = 0.0

# Общая стоимость преобретенных товаров.
totalCostProducts = 0.0

# Cумма налога с продаж.
tax = 0.7

# Итоговая сумма.
finalAmount = 0.0

