# Допустим, что переменная sales ссылается на вещественное значение.
# Напишите инструкцию, которая показывает значение, округленное до
# двух десятичных знаков после точки.

sales = 3.1456789
print(f'{sales:.2f}')