# Эта программа сравнивает два строкрвых
# значения.

# Получить от пользоватедя пароль.
password = input('Введите пароль: ')

# Определить, был ли введен правильный пароль.
if password == 'prospero':
    print('Пароль принят.')
else:
    print('Извирните, этот пароль неверный.')
