# Создать переменные, которые ссылаются на два строковых значения.
first_name = 'Кэтрин'
lastname = "Марино"

# Показать значения, на которые эти значения ссылаются.
print(first_name, lastname)